[
    {
        "job": "Project Consultant - Senior Javascript Fullstack Developer, SRS Acquiom",
        "org": "AIM Consulting (Remote)",
        "location": "Seattle, WA",
        "date": "March 2022 - Current",
        "cvitems": {
            "items": [
                "Project 2: \\textbf{Microfrontend} development in \\textbf{Stencil}, \\textbf{Typescript}, \\textbf{PostCSS}, and \\textbf{Tailwind}; \\textbf{Services} development in \\textbf{NestJS} and \\textbf{PostgreSQL}. Development with \\textbf{AWS SNS}, \\textbf{Bitbucket Pipelines}, \\textbf{Jenkins}, and \\textbf{Jest}.",
                "Project 2: \\textbf{Scaffolding frontend repos for new component library and microfrontends} up through \\textbf{CICD pipeline}. Built new \\textbf{custom elements} / \\textbf{web components} for component library. Integration work with \\textbf{AWS} services. \\textbf{Fullstack development} from SQL queries and restructuring data for data contracts to frontend API consumption and new UI features.",
                "Project 1: \\textbf{Microfrontend} development in \\textbf{Svelte}, \\textbf{Typescript}, \\textbf{HTML}, \\textbf{SASS}, and \\textbf{Tailwind}. \\textbf{Microservices} development in \\textbf{Express}, \\textbf{Kafkajs}, \\textbf{PostgreSQL}, \\textbf{Flyway}, and \\textbf{Node.js}. Additional work in \\textbf{Docker} / \\textbf{Docker Compose}, \\textbf{Bitbucket Pipelines}, \\textbf{Jenkins}, \\textbf{Kubernetes} / \\textbf{Knative}, \\textbf{AWS}, \\textbf{Istio}, and \\textbf{Logz.io}.",
                "Project 1: \\textbf{Took on major technical challenges} and \\textbf{established new processes and best practices and increased test coverage} across the entire stack.",
                "\\textbf{Consistently delivered client satisfaction} with vague definitions and unclear iterative guidelines."
            ]
        }
    },
    {
        "job": "Project Consultant - SDET / Fullstack developer, Medinformatix",
        "org": "AIM Consulting (Remote)",
        "location": "Seattle, WA",
        "date": "September 2021 - March 2022",
        "cvitems": {
            "items": [
                "\\textbf{Test automation} development in \\textbf{Cypress} and \\textbf{Typescript}. \\textbf{Frontend} development in \\textbf{Angular} and \\textbf{Typescript}. \\textbf{Backend} services work in \\textbf{Express} and \\textbf{Swagger}. Additional work in \\textbf{Jest}, \\textbf{Gulp}, and \\textbf{Webpack}.",
                "\\textbf{Built DRY, easily maintainable page object class inheritance automation framework}, along with a system of \\textbf{API call interceptions and mock response data}, allowing \\textbf{quick efficient testing of a completely decoupled frontend} following a \\textbf{test driven development} philosophy.",
                "\\textbf{Contributed to frontend and backend projects with bug fixes and functional updates} to support desynced front and backend development efforts. \\textbf{Swarmed on every aspect of the project} from frontend and backend to build processes and devops."
            ]
        }
    },
    {
        "job": "Software Engineer",
        "org": "Lululemon",
        "location": "Seattle, WA",
        "date": "November 2018 - April 2021",
        "cvitems": {
            "items": [
                "\\textbf{Test automation} development in \\textbf{Typescript}, \\textbf{WebdriverIO}, \\textbf{Javascript}, \\textbf{Travis}, \\textbf{AWS}, \\textbf{Selenium}, \\textbf{Postman}, \\textbf{Puppeteer}, and \\textbf{Supertest}.",
                "\\textbf{Reduced sprint regression time by over 92\\%}, from 16 hours to 1 hour and 10 minutes.",
                "Developed automation projects \\textbf{from green field to full fledged CICD integrated suites with AWS S3 reporting in use by 3+ teams}.",
                "Converted entire project from Javascript to Typescript and \\textbf{significantly reduced false positives} from incorrect usage.",
                "\\textbf{Mentored manual QA engineers} in Javascript, git, and coding practices."
            ]
        }
    },
    {
        "job": "Software Engineer",
        "org": "Glympse",
        "location": "Seattle, WA",
        "date": "July 2016 - July 2018",
        "cvitems": {
            "items": [
                "\\textbf{Frontend} development in \\textbf{Javascript}, \\textbf{jQuery}, \\textbf{Angular}, \\textbf{HTML}, \\textbf{CSS} / \\textbf{SASS} / \\textbf{Less}, \\textbf{Grunt}, \\textbf{Webpack}, \\textbf{Git}, and \\textbf{Node.js} / \\textbf{NPM} / \\textbf{Yarn}.",
                "\\textbf{Collaborated} with all other teams and \\textbf{implemented new features}, \\textbf{fixed bugs}, \\textbf{improved internal tooling} / \\textbf{deployment pipelines}, for core Glympse products, developer documentation site, and other various projects.",
                "Took on learning and implementing with new technologies on the fly, including \\textbf{Python}, \\textbf{Bash} / \\textbf{Batch} scripting, \\textbf{Jinja}, \\textbf{.NET}, \\textbf{Wordpress}, \\textbf{Google Analytics}, and \\textbf{Tizen}.",
                "\\textbf{Sole frontend developer onsite for second year}, who directly \\textbf{supported Solutions team in fully randomized role} with quick turnaround time."
            ]
        }
    },
    {
        "abbreviate": true,
        "job": "Mobile Applications Developer",
        "org": "Holland America Line",
        "location": "Seattle, WA",
        "date": "June 2015 - July 2016",
        "cvitems": {
            "items": [
                "Frontend developer on Mobile Applications team. Went from SDET to developer on the job. Continued support of test efforts where appropriate. Responsible for UI updates, helping to script and implement new deployment process, maintaining and optimizing app environment on all target cruise ships",
                "Part of effort to proof, test, and document new VM deployment setup and process. Traveled to multiple HAL ships (ms Eurodam and Koningsdam, latter solo trip) and successfully deployed new VM to replace older setup. Successful proof of concept of process for all other ships in the fleet. Collaborated with onboard crew to fix data issues, and performed on the fly application upgrades to fix cross team issues",
                "Performed bash scripting, log analysis, remote deploys and other DevOps support tasks",
                "Prototyped and implemented coordinate system for displaying event locations",
                "Refactored gulp and grunt pipelines for unit testing, local deploys, production packaging, and other logic pathing for multi brand/environment support",
                "Implemented single-click api mocking, allowing application to run without necessitating being connected to the backend for development and/or demo purposes",
                "Implemented feature flagging plugin and service, allowing application features to be turned on and off via a JSON file without impacting other functionality"
            ]
        }
    },
    {
        "abbreviate": true,
        "job": "SDET",
        "org": "Holland America Line",
        "location": "Seattle, WA",
        "date": "December 2014 - June 2015",
        "cvitems": {
            "items": [
                "SDET on Mobile Applications team. Went from QA to SDET on the job. Tested the HAL Mobile Guest Experience Application with both manual and automated techniques. Began contributing bug fixes and functional updates to application code",
                "Helped revamp automation test suite to better sync with industry standards",
                "Brought e2e automated test suite from non-working to functional status",
                "Switched between manual and automated testing to provide as much quality coverage as possible per project time constraints",
                "Wrote automation tests in Protractor/Jasmine",
                "Swarmed on application development tasks as the need arose with bug fixes and functionality updates"
            ]
        }
    },
    {
        "abbreviate": true,
        "job": "QA Tester",
        "org": "Holland America Line",
        "location": "Seattle, WA",
        "date": "October 2014 - December 2014",
        "cvitems": {
            "items": [
                "Responsible for manual testing of the HAL Mobile Guest Experience Application.",
                "Helped to revamp QA and agile process toward industry standards",
                "Developed complete test case suite based on existing or lack of business requirements from scratch",
                "Worked closely with developers on improving user experience with or in spite of available design guidelines",
                "Improved communication of quality issues exponentially",
                "Enforced documentation of processes and standards",
                "Performed functional and regression testing on responsive application across multiple browsers and platforms"
            ]
        }
    },
    {
        "abbreviate": true,
        "job": "Contract QA Tester",
        "org": "LiveAreaLabs",
        "location": "Seattle, WA",
        "date": "July 2014 - September 2014",
        "cvitems": {
            "items": [
                "Temporary contract QA for seasonal eCommerce website overhaul",
                "Responsible for testing eCommerce websites based on the Demandware platform",
                "Created test cases based on wireframes and comps",
                "Investigated and adapted to design inconsistencies and/or shifting client demands",
                "Performed functional and regression testing on responsive sites across desktop, tablet, and mobile"
            ]
        }
    },
    {
        "abbreviate": true,
        "job": "QA Engineer",
        "org": "Ratio LLC/Cypress Consulting",
        "location": "Seattle, WA",
        "date": "August 2012 - February 2014",
        "cvitems": {
            "items": [
                "Responsible for testing applications and taking lead on testing efforts across multiple projects",
                "Performed gray box regression, functional, ad hoc testing on websites and mobile apps",
                "Automated repetitive tasks and learned test automation techniques",
                "Utilized tools like Fiddler to simulate unique test scenarios",
                "Worked closely with developers to optimize testing effort",
                "Created builds for testing and for client releases",
                "Documented build process and environment setup",
                "Helped strategize testing effort and documented with a formal test plan",
                "Created a test cases template for the general QA team with automatic statistics"
            ]
        }
    },
    {
        "abbreviate": true,
        "job": "QA Engineer",
        "org": "Zeebo, Inc.",
        "location": "San Diego, CA",
        "date": "September 2008 - January 2012",
        "cvitems": {
            "items": [
                "Responsible for UI and hardware black/grey box testing (functional, regression, and more)",
                "Ran functional tests on new features, wrote bugs to TTPro and later Redmine system, ran regression tests on fixed bugs, took logs using Qualcomm logging systems, ran specialized tests whenever necessary in cooperation with developers",
                "Coordination with UI developer lead in person and by email",
                "Helping to design and create a remote/international testing system by creative usage of available resources, to replace failed contract by professional remote testing company, allowing potential testing of device units in China, Brazil, or India from San Diego office",
                "Configured, created and published UI software packages for Zeebo's initial product throughout the entire commercial lifetime of the product through three years, to all end users in Brazil and Mexico, maintaining revision control and backups of major packages customized for Spanish or Portuguese language where applicable"
            ]
        }
    }
]